{"gems":{"name":"google-cloud-privileged_access_manager-v1","downloads":3566,"version":"1.4.0","version_created_at":"2025-10-08T17:55:30.283Z","version_downloads":2,"platform":"ruby","authors":"Google LLC","info":"## Overview Privileged Access Manager (PAM) is a Google Cloud native, managed solution to secure, manage and audit privileged access while ensuring operational velocity and developer productivity. PAM enables just-in-time, time-bound, approval-based access elevations, and auditing of privileged access elevations and activity. PAM lets you define the rules of who can request access, what they can request access to, and if they should be granted access with or without approvals based on the sensitivity of the access and emergency of the situation. ## Concepts ### Entitlement An entitlement is an eligibility or license that allows specified users (requesters) to request and obtain access to specified resources subject to a set of conditions such as duration, etc. entitlements can be granted to both human and non-human principals. ### Grant A grant is an instance of active usage against the entitlement. A user can place a request for a grant against an entitlement. The request may be forwarded to an approver for their decision. Once approved, the grant is activated, ultimately giving the user access (roles/permissions) on a resource per the criteria specified in entitlement. ### How does PAM work PAM creates and uses a service agent (Google-managed service account) to perform the required IAM policy changes for granting access at a specific resource/access scope. The service agent requires getIAMPolicy and setIAMPolicy permissions at the appropriate (or higher) access scope - Organization/Folder/Project to make policy changes on the resources listed in PAM entitlements. When enabling PAM for a resource scope, the user/ principal performing that action should have the appropriate permissions at that resource scope (resourcemanager.{projects|folders|organizations}.setIamPolicy, resourcemanager.{projects|folders|organizations}.getIamPolicy, and resourcemanager.{projects|folders|organizations}.get) to list and grant the service agent/account the required access to perform IAM policy changes. Note that google-cloud-privileged_access_manager-v1 is a version-specific client library. For most uses, we recommend installing the main client library google-cloud-privileged_access_manager instead. See the readme for more details.","licenses":["Apache-2.0"],"metadata":{},"yanked":false,"sha":"5182604ebd66debf672ae5ae47d609f1efba6054008827eda5e19078f9672e36","spec_sha":"26854fb5cd88776d275e117c35c5ea5b033ae1f717bea492fbf188acf2158f89","project_uri":"https://rubygems.org/gems/google-cloud-privileged_access_manager-v1","gem_uri":"https://rubygems.org/gems/google-cloud-privileged_access_manager-v1-1.4.0.gem","homepage_uri":"https://github.com/googleapis/google-cloud-ruby","wiki_uri":null,"documentation_uri":"https://www.rubydoc.info/gems/google-cloud-privileged_access_manager-v1/1.4.0","mailing_list_uri":null,"source_code_uri":null,"bug_tracker_uri":null,"changelog_uri":null,"funding_uri":null,"dependencies":{"development":[],"runtime":[{"name":"gapic-common","requirements":"~> 1.2"},{"name":"google-cloud-errors","requirements":"~> 1.0"},{"name":"google-cloud-location","requirements":"~> 1.0"}]}},"vcs_name":"GitHub","ci":1,"github_actions":1,"vcs_uri":"https://github.com/googleapis/google-cloud-ruby"}