{"gems":{"name":"google-shopping-merchant-reviews-v1beta","downloads":996,"version":"0.5.0","version_created_at":"2025-08-12T00:51:28.362Z","version_downloads":24,"platform":"ruby","authors":"Google LLC","info":"Merchant API consists of multiple Sub-APIs. Accounts Sub-API: Enables you to programmatically manage your accounts. Conversions Sub-API: Enables you to programmatically manage your conversion sources for a merchant account. Datasources Sub-API: Enables you to programmatically manage your datasources. Inventories Sub-API: This bundle enables you to programmatically manage your local and regional inventories. Local Feeds Partnerships Sub-API: This bundle enables LFP partners to submit local inventories for a merchant. Notifications Sub-API: This bundle enables you to programmatically manage your notification subscriptions. Products Sub-API: This bundle enables you to programmatically manage your products. Promotions Sub-API: This bundle enables you to programmatically manage your promotions for products. Quota Sub-API: This bundle enables you to list your quotas for all APIs you are using. Reports Sub-API: This bundle enables you to programmatically retrieve reports and insights about products, their performance and their competitive environment. Note that google-shopping-merchant-reviews-v1beta is a version-specific client library. For most uses, we recommend installing the main client library google-shopping-merchant-reviews instead. See the readme for more details.","licenses":["Apache-2.0"],"metadata":{},"yanked":false,"sha":"8e94fa95fa0aa2f600ef1ce15ed886bc04cd931961f552e5df458b0d4bb709c4","spec_sha":"6a1a944b6451f7c269a78274ab760b7c872346d3811430edb5b9771da9b563a3","project_uri":"https://rubygems.org/gems/google-shopping-merchant-reviews-v1beta","gem_uri":"https://rubygems.org/gems/google-shopping-merchant-reviews-v1beta-0.5.0.gem","homepage_uri":"https://github.com/googleapis/google-cloud-ruby","wiki_uri":null,"documentation_uri":"https://www.rubydoc.info/gems/google-shopping-merchant-reviews-v1beta/0.5.0","mailing_list_uri":null,"source_code_uri":null,"bug_tracker_uri":null,"changelog_uri":null,"funding_uri":null,"dependencies":{"development":[],"runtime":[{"name":"gapic-common","requirements":"~> 1.0"},{"name":"google-cloud-errors","requirements":"~> 1.0"},{"name":"google-shopping-type","requirements":"> 0.0, < 2.a"}]}},"vcs_name":"GitHub","ci":1,"github_actions":1,"vcs_uri":"https://github.com/googleapis/google-cloud-ruby"}