{"gems":{"name":"dsu","downloads":60,"version":"0.1.0.alpha.2","version_created_at":"2023-05-08T12:58:23.187Z","version_downloads":0,"platform":"ruby","authors":"Gene M. Angelo, Jr.","info":"    dsu is little gem that helps manage your Agile DSU (Daily Stand Up) participation. How? by providing a simple command line interface (CLI) which allows you to create, read, update, and delete (CRUD) noteworthy activities that you performed during your day. During your DSU, you can then easily recall and share these these activities with your team. Activities are grouped by day and can be viewed in simple text format from the command line. When viewing a particular day, dsu will automatically display the previous day's activities as well. This is useful for remembering what you did yesterday, so you can share your \"Today\" and \"Yesterday\" activities with your team during your DSU.\n\n    NOTE: This gem is currently in development (alpha release) and does not provide the ability to UPDATE or DELETE activities. These features will be added in future releases.\n\n    IN ADDITION TO THIS: dsu's current behavior when viewing a particular day is to display the previous day's activities. This behavior is not necessarily ideal when sharing activities for a DSU that occurs on a Monday. This is because Monday's DSU typically includes sharing what you did on last FRIDAY (not necessarily \"Yesterday\"), as well as what you plan on doing \"Today\". This behavior will be changed in a future release as well, to display the previous Friday's activities (as well as Saturday and Sunday) if \"Today\" happens to be Monday.\n","licenses":["MIT"],"metadata":{"homepage_uri":"https://github.com/gangelo/dsu","changelog_uri":"https://github.com/gangelo/dsu/blob/main/CHANGELOG.md","source_code_uri":"https://github.com/gangelo/dsu","rubygems_mfa_required":"true"},"yanked":false,"sha":"e42439f8c201aca7b4746f929b2e44a46ac09c71b184e202332abcfbfd661f17","project_uri":"https://rubygems.org/gems/dsu","gem_uri":"https://rubygems.org/gems/dsu-0.1.0.alpha.2.gem","homepage_uri":"https://github.com/gangelo/dsu","wiki_uri":null,"documentation_uri":null,"mailing_list_uri":null,"source_code_uri":"https://github.com/gangelo/dsu","bug_tracker_uri":null,"changelog_uri":"https://github.com/gangelo/dsu/blob/main/CHANGELOG.md","funding_uri":null,"dependencies":{"development":[],"runtime":[{"name":"activesupport","requirements":"~> 7.0, >= 7.0.4"},{"name":"colorize","requirements":"~> 0.8.1"},{"name":"deco_lite","requirements":"~> 1.3"},{"name":"os","requirements":"~> 1.1, >= 1.1.4"},{"name":"thor","requirements":"~> 1.2, >= 1.2.1"},{"name":"thor_nested_subcommand","requirements":"~> 1.0"}]}},"vcs_name":"GitHub","ci":null,"vcs_uri":"https://github.com/gangelo/dsu"}