{"gems":{"name":"dsu","downloads":1088,"version":"1.2.1","version_created_at":"2023-06-02T17:30:39.318Z","version_downloads":16,"platform":"ruby","authors":"Gene M. Angelo, Jr.","info":"    dsu is a small, but powerful gem that helps manage your Agile DSU (Daily Stand Up) participation. How? by providing a simple command-line interface (CLI) which allows you to create, read, update, and delete (CRUD) your DSU entries (activities). During your DSU, you can use dsu's CLI to list and share what you did \"yesterday\" and what you plan on doing \"Today\" with your team. DSU entries are grouped by day and can be viewed in simple text format from the command-line. When displaying DSU entries for a particular day, dsu will also display DSU entries for the previous day. If the day you are trying to display falls on a weekend or Monday, dsu will automatically search back to include the weekend and previous Friday dates and display the entries; this is so that you can share what you did over the weekend (if anything) and the previous Friday with your team. When searching for \"Yesterday's\" DSU entries, dsu will automatically search back a maximimum of 7 days to find DSU entries to share. This could be helpful if, for example, if you are sharing what you plan to do today (Wednesday), but were sick yesterday (Tuesday); dsu in this case will display the last DSU entries it can find searching backwards a maximum of 7 days. dsu does a LOT more and is perfect for command-line junkies and those who LOVE simplicity. Give it a try and a star if you like it!\n","licenses":["MIT"],"metadata":{"homepage_uri":"https://github.com/gangelo/dsu","changelog_uri":"https://github.com/gangelo/dsu/blob/main/CHANGELOG.md","source_code_uri":"https://github.com/gangelo/dsu","rubygems_mfa_required":"true"},"yanked":false,"sha":"d38b1079358e8a24822a525f75f2625fdf41aaae997be1e166c73643b6faa95b","project_uri":"https://rubygems.org/gems/dsu","gem_uri":"https://rubygems.org/gems/dsu-1.2.1.gem","homepage_uri":"https://github.com/gangelo/dsu","wiki_uri":null,"documentation_uri":null,"mailing_list_uri":null,"source_code_uri":"https://github.com/gangelo/dsu","bug_tracker_uri":null,"changelog_uri":"https://github.com/gangelo/dsu/blob/main/CHANGELOG.md","funding_uri":null,"dependencies":{"development":[],"runtime":[{"name":"activemodel","requirements":"~> 7.0, >= 7.0.4.3"},{"name":"activesupport","requirements":"~> 7.0, >= 7.0.4"},{"name":"colorize","requirements":"~> 0.8.1"},{"name":"os","requirements":"~> 1.1, >= 1.1.4"},{"name":"thor","requirements":"~> 1.2, >= 1.2.1"},{"name":"thor_nested_subcommand","requirements":"~> 1.0"}]}},"vcs_name":"GitHub","ci":null,"vcs_uri":"https://github.com/gangelo/dsu"}